#Задача 1 
x = int(input("Введите число:"))
y = 7 * x + 5
print("Ответ: y=",y)

#Задача 2
a = int(input("Введите сторону квадрата:"))
b = a*4
print("Периметр квадрата равен:",b)

#Задача 3 
a = float(3.14)
R = int(input("Радиус равен:"))
P = 2 * R * a
print("Длина окружности равна:",P)
 
#Задача 4 
P = float(3.14)
R = int(input("Введите радиус окружности:"))
S = P * R**2
print("Площадь окружности равна:", S)

#Задача 5 
a = int(input("Первый катет:"))
b = int(input("Второй катет:"))
c = a**2 + b**2
print("Возьмём под корень число:", c)
print("Гипотенуза равна:",c**(0.5))

#Задача 6 
a = int(input("Первый катет:"))
b = int(input("Второй катет:"))
c = a**2 + b**2
print("Возьмём под корень число:", c)
print("Гипотенуза равна:",c**(0.5))
P = a + b + c**(0.5)
print("Периметр равен:", P)

#Задача 7
a = int(input("Первая сторона прямоугольника:"))
b = int(input("Вторая сторона прямоугольника:"))
c = (a**2 + b**2)
P = 2*(a + b)
print("Длина диагонали:",c**(0.5))
print("Периметр прямоугольника:", P)

#Задача 8 
R = int(input("Радиус внешней окружности:"))
r = int(input("Радиус внутренней окружности:"))
P = float(3.14)
S = P*(R**2 - r**2)
print("Площадь кольца равна:", S)

#Задача 9 
a = int(input("Ребро куба равно:"))
V = a**3
S = 6 * a**2
print("Объём куба равен", V)
print("Площадь куба равна:", S)

#Задача 10 
a = int(input("Первое основание трапеции:"))
b = int(input("Второе основание трапеции:"))
H = int(input("Высота трапеции:"))
P = 2 * (a + b) + 2 * H
print("Периметр трапеции:", P)


