#Задача 2 
def calculate_area(length, width):
    area = dlina * shirina
    return area
def calculate_perimeter(dlina, shirina):
    perimeter = 2 * (dlina + shirina)
    return perimeter
def print_rectangle_properties(area, perimeter):
    print("Площадь прямоугольника:", area)
    print("Периметр прямоугольника:", perimeter)
length = 5
width = 10
rectangle_a = calculate_area(length, width)
rectangle_p = calculate_perimeter(length, width)
print_r(rectangle_area, rectangle_perimeter)
if rectangle_a > 30:
    print("Площадь прямоугольника больше 30")
else:
    print("Площадь прямоугольника меньше или равна 30")